zup/ЗУП_бюджет/src/Documents/УтверждениеОкладовНадбавокЗаКлассныеЧины/УтверждениеОкладовНадбавокЗаКлассныеЧины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УтверждениеОкладовНадбавокЗаКлассныеЧины</name>
  <registerRecords>InformationRegister.ОкладыНадбавкиПоКласснымЧинамРангам</registerRecords>
  <attributes>
    <name>ДатаВступленияВСилу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОкладыНадбавки</name>
    <attributes>
      <name>КлассныйЧинРанг</name>
      <type>
        <types>CatalogRef.КлассныеЧиныРанги</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/Documents/УтверждениеОкладовНадбавокЗаКлассныеЧины/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проведение документа
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	КлассныеЧиныРанги.СформироватьДвиженияОкладовНадбавокПоКласснымЧинамРангам(Движения, ДанныеДляПроведения.ОкладыНадбавкиПоКласснымЧинамРангам);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаВступленияВСилу, "Объект.ДатаВступленияВСилу", Отказ, НСтр("ru='Дата вступления в силу'"), , , Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УтверждениеОкладовНадбавокЗаКлассныеЧиныОкладыНадбавки.Ссылка.ДатаВступленияВСилу КАК Период,
	               |	УтверждениеОкладовНадбавокЗаКлассныеЧиныОкладыНадбавки.КлассныйЧинРанг,
	               |	УтверждениеОкладовНадбавокЗаКлассныеЧиныОкладыНадбавки.Размер
	               |ИЗ
	               |	Документ.УтверждениеОкладовНадбавокЗаКлассныеЧины.ОкладыНадбавки КАК УтверждениеОкладовНадбавокЗаКлассныеЧиныОкладыНадбавки
	               |ГДЕ
	               |	УтверждениеОкладовНадбавокЗаКлассныеЧиныОкладыНадбавки.Ссылка = &Ссылка";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеДляПроведения = Новый Структура;
	
	ОкладыНадбавкиПоКласснымЧинамРангам = РезультатЗапроса.Выгрузить();
	ДанныеДляПроведения.Вставить("ОкладыНадбавкиПоКласснымЧинамРангам", ОкладыНадбавкиПоКласснымЧинамРангам);
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
